7767517
76 77
Input                    input_image:0            0 1 input_image:0
BinaryOp                 pred/Sub                 1 1 input_image:0 pred/Sub:0 0=1 1=1 2=1.280000e+02
BinaryOp                 pred/div                 1 1 pred/Sub:0 pred/div:0 0=3 1=1 2=1.280000e+02
Crop                     pred/strided_slice_3     1 1 pred/div:0 pred/strided_slice_3:0 -23309=2,0,0 -23310=2,240,320 -23311=2,0,1
Permute                  pred/MobilenetV2/Conv/Conv2D__40 1 1 pred/strided_slice_3:0 pred/MobilenetV2/Conv/Conv2D__40:0 0=4
Convolution              pred/MobilenetV2/Conv/Conv2D 1 1 pred/MobilenetV2/Conv/Conv2D__40:0 pred/MobilenetV2/Conv/Conv2D:0 0=24 1=3 3=2 15=1 16=1 5=1 6=216
Permute                  pred/MobilenetV2/Conv/BatchNorm/FusedBatchNorm__43 1 1 pred/MobilenetV2/Conv/Conv2D:0 pred/MobilenetV2/Conv/BatchNorm/FusedBatchNorm__43:0 0=3
Clip                     pred/MobilenetV2/Conv/Relu6 1 1 pred/MobilenetV2/Conv/BatchNorm/FusedBatchNorm__43:0 pred/MobilenetV2/Conv/Relu6:0 0=0.000000e+00 1=6.000000e+00
Permute                  pred/MobilenetV2/expanded_conv/depthwise/depthwise__46 1 1 pred/MobilenetV2/Conv/Relu6:0 pred/MobilenetV2/expanded_conv/depthwise/depthwise__46:0 0=4
ConvolutionDepthWise     pred/MobilenetV2/expanded_conv/depthwise/depthwise 1 1 pred/MobilenetV2/expanded_conv/depthwise/depthwise__46:0 pred/MobilenetV2/expanded_conv/depthwise/depthwise:0 0=24 1=3 4=1 5=1 6=216 7=24
Permute                  pred/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm__52 1 1 pred/MobilenetV2/expanded_conv/depthwise/depthwise:0 pred/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm__52:0 0=3
Clip                     pred/MobilenetV2/expanded_conv/depthwise/Relu6 1 1 pred/MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNorm__52:0 pred/MobilenetV2/expanded_conv/depthwise/Relu6:0 0=0.000000e+00 1=6.000000e+00
Permute                  pred/MobilenetV2/expanded_conv/project/Conv2D__55 1 1 pred/MobilenetV2/expanded_conv/depthwise/Relu6:0 pred/MobilenetV2/expanded_conv/project/Conv2D__55:0 0=4
Convolution              pred/MobilenetV2/expanded_conv/project/Conv2D 1 1 pred/MobilenetV2/expanded_conv/project/Conv2D__55:0 pred/MobilenetV2/expanded_conv/project/Conv2D:0 0=16 1=1 5=1 6=384
Convolution              pred/MobilenetV2/expanded_conv_1/expand/Conv2D 1 1 pred/MobilenetV2/expanded_conv/project/Conv2D:0 pred/MobilenetV2/expanded_conv_1/expand/Conv2D:0 0=96 1=1 5=1 6=1536
Permute                  pred/MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm__62 1 1 pred/MobilenetV2/expanded_conv_1/expand/Conv2D:0 pred/MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm__62:0 0=3
Clip                     pred/MobilenetV2/expanded_conv_1/expand/Relu6 1 1 pred/MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNorm__62:0 pred/MobilenetV2/expanded_conv_1/expand/Relu6:0 0=0.000000e+00 1=6.000000e+00
Permute                  pred/MobilenetV2/expanded_conv_1/depthwise/depthwise__65 1 1 pred/MobilenetV2/expanded_conv_1/expand/Relu6:0 pred/MobilenetV2/expanded_conv_1/depthwise/depthwise__65:0 0=4
ConvolutionDepthWise     pred/MobilenetV2/expanded_conv_1/depthwise/depthwise 1 1 pred/MobilenetV2/expanded_conv_1/depthwise/depthwise__65:0 pred/MobilenetV2/expanded_conv_1/depthwise/depthwise:0 0=96 1=3 3=2 15=1 16=1 5=1 6=864 7=96
Permute                  pred/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm__71 1 1 pred/MobilenetV2/expanded_conv_1/depthwise/depthwise:0 pred/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm__71:0 0=3
Clip                     pred/MobilenetV2/expanded_conv_1/depthwise/Relu6 1 1 pred/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNorm__71:0 pred/MobilenetV2/expanded_conv_1/depthwise/Relu6:0 0=0.000000e+00 1=6.000000e+00
Permute                  pred/MobilenetV2/expanded_conv_1/project/Conv2D__74 1 1 pred/MobilenetV2/expanded_conv_1/depthwise/Relu6:0 pred/MobilenetV2/expanded_conv_1/project/Conv2D__74:0 0=4
Convolution              pred/MobilenetV2/expanded_conv_1/project/Conv2D 1 1 pred/MobilenetV2/expanded_conv_1/project/Conv2D__74:0 pred/MobilenetV2/expanded_conv_1/project/Conv2D:0 0=24 1=1 5=1 6=2304
Split                    splitncnn_0              1 2 pred/MobilenetV2/expanded_conv_1/project/Conv2D:0 pred/MobilenetV2/expanded_conv_1/project/Conv2D:0_splitncnn_0 pred/MobilenetV2/expanded_conv_1/project/Conv2D:0_splitncnn_1
Permute                  pred/MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm__77 1 1 pred/MobilenetV2/expanded_conv_1/project/Conv2D:0_splitncnn_1 pred/MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm__77:0 0=3
Convolution              pred/MobilenetV2/expanded_conv_2/expand/Conv2D 1 1 pred/MobilenetV2/expanded_conv_1/project/Conv2D:0_splitncnn_0 pred/MobilenetV2/expanded_conv_2/expand/Conv2D:0 0=144 1=1 5=1 6=3456
Permute                  pred/MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm__81 1 1 pred/MobilenetV2/expanded_conv_2/expand/Conv2D:0 pred/MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm__81:0 0=3
Clip                     pred/MobilenetV2/expanded_conv_2/expand/Relu6 1 1 pred/MobilenetV2/expanded_conv_2/expand/BatchNorm/FusedBatchNorm__81:0 pred/MobilenetV2/expanded_conv_2/expand/Relu6:0 0=0.000000e+00 1=6.000000e+00
Permute                  pred/MobilenetV2/expanded_conv_2/depthwise/depthwise__84 1 1 pred/MobilenetV2/expanded_conv_2/expand/Relu6:0 pred/MobilenetV2/expanded_conv_2/depthwise/depthwise__84:0 0=4
ConvolutionDepthWise     pred/MobilenetV2/expanded_conv_2/depthwise/depthwise 1 1 pred/MobilenetV2/expanded_conv_2/depthwise/depthwise__84:0 pred/MobilenetV2/expanded_conv_2/depthwise/depthwise:0 0=144 1=3 4=1 5=1 6=1296 7=144
Permute                  pred/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm__90 1 1 pred/MobilenetV2/expanded_conv_2/depthwise/depthwise:0 pred/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm__90:0 0=3
Clip                     pred/MobilenetV2/expanded_conv_2/depthwise/Relu6 1 1 pred/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/FusedBatchNorm__90:0 pred/MobilenetV2/expanded_conv_2/depthwise/Relu6:0 0=0.000000e+00 1=6.000000e+00
Permute                  pred/MobilenetV2/expanded_conv_2/project/Conv2D__93 1 1 pred/MobilenetV2/expanded_conv_2/depthwise/Relu6:0 pred/MobilenetV2/expanded_conv_2/project/Conv2D__93:0 0=4
Convolution              pred/MobilenetV2/expanded_conv_2/project/Conv2D 1 1 pred/MobilenetV2/expanded_conv_2/project/Conv2D__93:0 pred/MobilenetV2/expanded_conv_2/project/Conv2D:0 0=24 1=1 5=1 6=3456
Permute                  pred/MobilenetV2/expanded_conv_2/project/BatchNorm/FusedBatchNorm__96 1 1 pred/MobilenetV2/expanded_conv_2/project/Conv2D:0 pred/MobilenetV2/expanded_conv_2/project/BatchNorm/FusedBatchNorm__96:0 0=3
BinaryOp                 pred/MobilenetV2/expanded_conv_2/add 2 1 pred/MobilenetV2/expanded_conv_2/project/BatchNorm/FusedBatchNorm__96:0 pred/MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNorm__77:0 pred/MobilenetV2/expanded_conv_2/add:0
Permute                  pred/MobilenetV2/expanded_conv_3/expand/Conv2D__97 1 1 pred/MobilenetV2/expanded_conv_2/add:0 pred/MobilenetV2/expanded_conv_3/expand/Conv2D__97:0 0=4
Convolution              pred/MobilenetV2/expanded_conv_3/expand/Conv2D 1 1 pred/MobilenetV2/expanded_conv_3/expand/Conv2D__97:0 pred/MobilenetV2/expanded_conv_3/expand/Conv2D:0 0=144 1=1 5=1 6=3456
Permute                  pred/MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm__100 1 1 pred/MobilenetV2/expanded_conv_3/expand/Conv2D:0 pred/MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm__100:0 0=3
Clip                     pred/MobilenetV2/expanded_conv_3/expand/Relu6 1 1 pred/MobilenetV2/expanded_conv_3/expand/BatchNorm/FusedBatchNorm__100:0 pred/MobilenetV2/expanded_conv_3/expand/Relu6:0 0=0.000000e+00 1=6.000000e+00
Permute                  pred/MobilenetV2/expanded_conv_3/depthwise/depthwise__103 1 1 pred/MobilenetV2/expanded_conv_3/expand/Relu6:0 pred/MobilenetV2/expanded_conv_3/depthwise/depthwise__103:0 0=4
ConvolutionDepthWise     pred/MobilenetV2/expanded_conv_3/depthwise/depthwise 1 1 pred/MobilenetV2/expanded_conv_3/depthwise/depthwise__103:0 pred/MobilenetV2/expanded_conv_3/depthwise/depthwise:0 0=144 1=3 3=2 15=1 16=1 5=1 6=1296 7=144
Permute                  pred/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm__109 1 1 pred/MobilenetV2/expanded_conv_3/depthwise/depthwise:0 pred/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm__109:0 0=3
Clip                     pred/MobilenetV2/expanded_conv_3/depthwise/Relu6 1 1 pred/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/FusedBatchNorm__109:0 pred/MobilenetV2/expanded_conv_3/depthwise/Relu6:0 0=0.000000e+00 1=6.000000e+00
Permute                  pred/MobilenetV2/expanded_conv_3/project/Conv2D__112 1 1 pred/MobilenetV2/expanded_conv_3/depthwise/Relu6:0 pred/MobilenetV2/expanded_conv_3/project/Conv2D__112:0 0=4
Convolution              pred/MobilenetV2/expanded_conv_3/project/Conv2D 1 1 pred/MobilenetV2/expanded_conv_3/project/Conv2D__112:0 pred/MobilenetV2/expanded_conv_3/project/Conv2D:0 0=24 1=1 5=1 6=3456
Convolution              pred/MobilenetV2/expanded_conv_4/expand/Conv2D 1 1 pred/MobilenetV2/expanded_conv_3/project/Conv2D:0 pred/MobilenetV2/expanded_conv_4/expand/Conv2D:0 0=144 1=1 5=1 6=3456
Permute                  pred/MobilenetV2/expanded_conv_4/expand/BatchNorm/FusedBatchNorm__119 1 1 pred/MobilenetV2/expanded_conv_4/expand/Conv2D:0 pred/MobilenetV2/expanded_conv_4/expand/BatchNorm/FusedBatchNorm__119:0 0=3
Clip                     pred/MobilenetV2/expanded_conv_4/expand/Relu6 1 1 pred/MobilenetV2/expanded_conv_4/expand/BatchNorm/FusedBatchNorm__119:0 pred/MobilenetV2/expanded_conv_4/expand/Relu6:0 0=0.000000e+00 1=6.000000e+00
Permute                  pred/MobilenetV2/expanded_conv_4/depthwise/depthwise__122 1 1 pred/MobilenetV2/expanded_conv_4/expand/Relu6:0 pred/MobilenetV2/expanded_conv_4/depthwise/depthwise__122:0 0=4
ConvolutionDepthWise     pred/MobilenetV2/expanded_conv_4/depthwise/depthwise 1 1 pred/MobilenetV2/expanded_conv_4/depthwise/depthwise__122:0 pred/MobilenetV2/expanded_conv_4/depthwise/depthwise:0 0=144 1=3 4=1 5=1 6=1296 7=144
Permute                  pred/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm__128 1 1 pred/MobilenetV2/expanded_conv_4/depthwise/depthwise:0 pred/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm__128:0 0=3
Clip                     pred/MobilenetV2/expanded_conv_4/depthwise/Relu6 1 1 pred/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/FusedBatchNorm__128:0 pred/MobilenetV2/expanded_conv_4/depthwise/Relu6:0 0=0.000000e+00 1=6.000000e+00
Permute                  pred/MobilenetV2/expanded_conv_4/project/Conv2D__131 1 1 pred/MobilenetV2/expanded_conv_4/depthwise/Relu6:0 pred/MobilenetV2/expanded_conv_4/project/Conv2D__131:0 0=4
Convolution              pred/MobilenetV2/expanded_conv_4/project/Conv2D 1 1 pred/MobilenetV2/expanded_conv_4/project/Conv2D__131:0 pred/MobilenetV2/expanded_conv_4/project/Conv2D:0 0=48 1=1 5=1 6=6912
Convolution              pred/MobilenetV2/expanded_conv_5/expand/Conv2D 1 1 pred/MobilenetV2/expanded_conv_4/project/Conv2D:0 pred/MobilenetV2/expanded_conv_5/expand/Conv2D:0 0=288 1=1 5=1 6=13824
Permute                  pred/MobilenetV2/expanded_conv_5/expand/BatchNorm/FusedBatchNorm__138 1 1 pred/MobilenetV2/expanded_conv_5/expand/Conv2D:0 pred/MobilenetV2/expanded_conv_5/expand/BatchNorm/FusedBatchNorm__138:0 0=3
Clip                     pred/MobilenetV2/expanded_conv_5/expand/Relu6 1 1 pred/MobilenetV2/expanded_conv_5/expand/BatchNorm/FusedBatchNorm__138:0 pred/MobilenetV2/expanded_conv_5/expand/Relu6:0 0=0.000000e+00 1=6.000000e+00
Permute                  pred/MobilenetV2/expanded_conv_5/depthwise/depthwise__141 1 1 pred/MobilenetV2/expanded_conv_5/expand/Relu6:0 pred/MobilenetV2/expanded_conv_5/depthwise/depthwise__141:0 0=4
ConvolutionDepthWise     pred/MobilenetV2/expanded_conv_5/depthwise/depthwise 1 1 pred/MobilenetV2/expanded_conv_5/depthwise/depthwise__141:0 pred/MobilenetV2/expanded_conv_5/depthwise/depthwise:0 0=288 1=3 4=1 5=1 6=2592 7=288
Permute                  pred/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/FusedBatchNorm__147 1 1 pred/MobilenetV2/expanded_conv_5/depthwise/depthwise:0 pred/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/FusedBatchNorm__147:0 0=3
Clip                     pred/MobilenetV2/expanded_conv_5/depthwise/Relu6 1 1 pred/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/FusedBatchNorm__147:0 pred/MobilenetV2/expanded_conv_5/depthwise/Relu6:0 0=0.000000e+00 1=6.000000e+00
Permute                  pred/MobilenetV2/expanded_conv_5/project/Conv2D__150 1 1 pred/MobilenetV2/expanded_conv_5/depthwise/Relu6:0 pred/MobilenetV2/expanded_conv_5/project/Conv2D__150:0 0=4
Convolution              pred/MobilenetV2/expanded_conv_5/project/Conv2D 1 1 pred/MobilenetV2/expanded_conv_5/project/Conv2D__150:0 pred/MobilenetV2/expanded_conv_5/project/Conv2D:0 0=96 1=1 5=1 6=27648
Convolution              pred/local_head/detector/Conv/Conv2D 1 1 pred/MobilenetV2/expanded_conv_5/project/Conv2D:0 pred/local_head/detector/Conv/Conv2D:0 0=128 1=3 4=1 5=1 6=110592
Permute                  pred/local_head/detector/Conv/BatchNorm/FusedBatchNorm__157 1 1 pred/local_head/detector/Conv/Conv2D:0 pred/local_head/detector/Conv/BatchNorm/FusedBatchNorm__157:0 0=3
Clip                     pred/local_head/detector/Conv/Relu6 1 1 pred/local_head/detector/Conv/BatchNorm/FusedBatchNorm__157:0 pred/local_head/detector/Conv/Relu6:0 0=0.000000e+00 1=6.000000e+00
Permute                  pred/local_head/detector/Conv_1/BiasAdd__160 1 1 pred/local_head/detector/Conv/Relu6:0 pred/local_head/detector/Conv_1/BiasAdd__160:0 0=4
Convolution              pred/local_head/detector/Conv_1/BiasAdd 1 1 pred/local_head/detector/Conv_1/BiasAdd__160:0 pred/local_head/detector/Conv_1/BiasAdd:0 0=65 1=1 5=1 6=8320
Permute                  pred/local_head/detector/Conv_1/BiasAdd__161 1 1 pred/local_head/detector/Conv_1/BiasAdd:0 pred/local_head/detector/Conv_1/BiasAdd__161:0 0=3
Softmax                  pred/local_head/detector/Softmax 1 1 pred/local_head/detector/Conv_1/BiasAdd__161:0 pred/local_head/detector/Softmax:0 0=2 1=1
Crop                     pred/local_head/detector/strided_slice 1 1 pred/local_head/detector/Softmax:0 pred/local_head/detector/strided_slice:0 -23309=3,0,0,0 -23310=3,2147483647,2147483647,-1 -23311=3,0,1,2
Permute                  pred/local_head/detector/DepthToSpace__165 1 1 pred/local_head/detector/strided_slice:0 pred/local_head/detector/DepthToSpace__165:0 0=4
PixelShuffle             pred/local_head/detector/DepthToSpace 1 1 pred/local_head/detector/DepthToSpace__165:0 pred/local_head/detector/DepthToSpace:0 0=8
Permute                  pred/local_head/detector/DepthToSpace__166 1 1 pred/local_head/detector/DepthToSpace:0 pred/local_head/detector/DepthToSpace__166:0 0=3
Squeeze                  pred/local_head/detector/Squeeze 1 1 pred/local_head/detector/DepthToSpace__166:0 scores_dense:0 -23303=1,-1
